
beach_num_mapping = {
"1":"을왕리 해수욕장",
"2":"왕산 해수욕장",
"3":"하나개 해수욕장",
"4":"사계해안",
"5":"하모해변",
"6":"민머루 해수욕장",
"7":"장경리 해수욕장",
"8":"옹암 해수욕장",
"9":"논짓물",
"10":"수기 해수욕장",
"11":"동막 해수욕장",
"12":"서포리 해수욕장",
"13":"십리포 해수욕장",
"14":"굴업 해수욕장",
"15":"떼뿌루 해수욕장",
"16":"밧지름 해수욕장",
"17":"한담해변",
"18":"알작지",
"19":"한들 해수욕장",
"20":"큰풀안 해수욕장",
"21":"장골 해수욕장",
"22":"벌안 해수욕장",
"23":"지두리 해수욕장",
"24":"검멀레해변",
"25":"세화해변",
"26":"모래울 해수욕장",
"27":"평대해변",
"28":"제주신흥해수욕장",
"29":"월정리해변(월정리해수욕장)",
"30":"큰말 해수욕장",
"31":"진촌 해수욕장",
"32":"보길도 뾰쪽산과 보옥리 공룡알해변",
"33":"진산리해수욕장",
"34":"작은풀안 해수욕장",
"35":"이일레 해수욕장",
"36":"문갑 해수욕장",
"37":"계남 해수욕장",
"38":"미라리해수욕장",
"39":"제부도 해수욕장",
"40":"궁평리 해수욕장",
"41":"대천 해수욕장",
"42":"벌천포 해수욕장",
"43":"춘장대 해수욕장",
"44":"꽃지 해수욕장",
"45":"구름포 해수욕장",
"46":"마검포 해수욕장",
"47":"지리해수욕장",
"48":"용두 해수욕장",
"49":"독산(홀뫼) 해수욕장",
"50":"장안 해수욕장",
"51":"무창포 해수욕장",
"52":"밧개 해수욕장",
"53":"두여 해수욕장",
"54":"안면 해수욕장",
"55":"삼봉 해수욕장",
"56":"백사장 해수욕장",
"57":"방포 해수욕장",
"58":"기지포 해수욕장",
"59":"샛별 해수욕장",
"60":"정도리해변",
"61":"장삼포 해수욕장",
"62":"바람아래 해수욕장",
"63":"몽산포 해수욕장",
"64":"달산포 해수욕장",
"65":"청포대 해수욕장",
"66":"갈음이 해수욕장",
"67":"연포 해수욕장",
"68":"천리포 해수욕장",
"69":"의항 해수욕장",
"70":"만리포 해수욕장",
"71":"어은돌 해수욕장",
"72":"파도리 해수욕장",
"73":"학암포 해수욕장",
"74":"구례포 해수욕장",
"75":"신두리 해수욕장",
"76":"오천몽돌해변",
"77":"꾸지나무골 해수욕장",
"78":"난지도 해수욕장",
"79":"원산도 해수욕장",
"80":"송평해변",
"81":"남성리해수욕장",
"82":"오봉산 해수욕장",
"83":"명장섬 해수욕장",
"84":"덕동몽돌해수욕장",
"85":"유동해변",
"86":"당산 해수욕장",
"87":"통개 해수욕장",
"88":"띠밭넘어해변",
"89":"거멀너머 해수욕장",
"90":"진너머 해수욕장",
"91":"선유도 해수욕장",
"92":"동호 해수욕장",
"93":"모항 갯벌 해수욕장",
"94":"흰작살해변",
"95":"격포 해수욕장",
"96":"고사포 해수욕장",
"97":"변산 해수욕장",
"98":"위도 해수욕장",
"99":"외달도 해수욕장",
"100":"천하몽돌해수욕장",
"101":"안도 해수욕장",
"102":"장등 해수욕장",
"103":"모사금 해수욕장",
"104":"만성리검은모래 해수욕장",
"105":"신덕 해수욕장",
"106":"방죽포 해수욕장",
"107":"사도 해수욕장",
"108":"거문도(유림) 해수욕장",
"109":"남해 가천 해변과 암수바위",
"110":"연대도 해수욕장",
"111":"선구몽돌해변",
"112":"용동 해수욕장",
"113":"익금 해수욕장",
"114":"연소 해수욕장",
"115":"발포 해수욕장",
"116":"염포 해수욕장",
"117":"나로우주 해수욕장",
"118":"풍류 해수욕장",
"119":"대전 해수욕장",
"120":"남열해돋이 해수욕장",
"121":"덕흥 해수욕장",
"122":"율포 해수욕장",
"123":"수문 해수욕장",
"124":"항도몽돌해수욕장과 항도방파제",
"125":"사구미 해수욕장",
"126":"하트해변(하누넘해수욕장)",
"127":"송호땅끝 해수욕장",
"128":"홀통 해수욕장",
"129":"톱머리 해수욕장",
"130":"구미동해변 (구미동해수욕장)",
"131":"돌머리 해수욕장",
"132":"모상개해수욕장",
"133":"가마미 해수욕장",
"134":"송이도 해수욕장",
"135":"금일해당화 해수욕장",
"136":"신지명사십리 해수욕장",
"137":"가사동백숲 해수욕장",
"138":"동고 해수욕장",
"139":"지리청송 해수욕장",
"140":"통리솔밭 해수욕장",
"141":"중리 해수욕장",
"142":"예송갯돌 해수욕장",
"143":"금곡 해수욕장",
"144":"가계 해수욕장",
"145":"금갑 해수욕장",
"146":"죽림해수욕장",
"147":"관매도 해수욕장",
"148":"신전 해수욕장",
"149":"분계 해수욕장",
"150":"우전 해수욕장",
"151":"대광 해수욕장",
"152":"백길 해수욕장",
"153":"원평 해수욕장",
"154":"하트 해수욕장",
"155":"시목 해수욕장",
"156":"돈목 해수욕장",
"157":"금장 해수욕장",
"158":"무술목 해수욕장",
"159":"화포해변",
"160":"둔장해변",
"161":"배알도해수욕장",
"162":"두모몽돌해변",
"163":"조금나루해수욕장",
"164":"몰운대(부산 국가지질공원)",
"165":"감지해변",
"166":"안악해수욕장",
"167":"손죽 해수욕장",
"168":"신흥 해수욕장",
"169":"나사해변(나사리해수욕장)",
"170":"모래미 해변",
"171":"솔개해수욕장",
"172":"강문 해수욕장",
"173":"송정 해수욕장",
"174":"안목 해수욕장",
"175":"남항진 해수욕장",
"176":"경포 해수욕장",
"177":"사근진 해수욕장",
"178":"순긋 해수욕장",
"179":"주문진 해수욕장",
"180":"주전몽돌해변",
"181":"안인 해수욕장",
"182":"정동진 해수욕장",
"183":"등명 해수욕장",
"184":"도직 해수욕장",
"185":"옥계 해수욕장",
"186":"금진 해수욕장",
"187":"하평해변",
"188":"사천 해수욕장",
"189":"영진 해수욕장",
"190":"연곡 해수욕장",
"191":"상록해수욕장",
"192":"강동몽돌해변",
"193":"신명·정자해변",
"194":"나아해변",
"195":"추암 해수욕장",
"196":"어달 해수욕장",
"197":"대진 해수욕장",
"198":"망상 해수욕장",
"199":"노봉 해수욕장",
"200":"등대 해수욕장",
"201":"속초 해수욕장",
"202":"외옹치 해수욕장",
"203":"삼척 해수욕장",
"204":"작은후진 해수욕장",
"205":"증산 해수욕장",
"206":"오분해변",
"207":"옥돌해수욕장",
"208":"몽돌해수욕장/몽돌해변",
"209":"신창 간이 해수욕장",
"210":"흥환간이해수욕장",
"211":"송도해변(포항)",
"212":"상맹방 해수욕장",
"213":"하맹방 해수욕장",
"214":"맹방 해수욕장",
"215":"덕산 해수욕장",
"216":"부남해변",
"217":"궁촌 해수욕장",
"218":"원평 해수욕장",
"219":"문암 해수욕장",
"220":"용화 해수욕장",
"221":"장호 해수욕장",
"222":"거진1리 해수욕장",
"223":"거진11리 해수욕장",
"224":"대진1리 해수욕장",
"225":"대진5리 해수욕장",
"226":"화진포 해수욕장",
"227":"초도리 해수욕장",
"228":"반암리 해수욕장",
"229":"마차진 해수욕장",
"230":"명파 해수욕장",
"231":"송지호 해수욕장",
"232":"봉수대 해수욕장",
"233":"가진리 해수욕장",
"234":"공현1리 해수욕장",
"235":"공현2리 해수욕장",
"236":"삼포 해수욕장",
"237":"삼포2리 해수욕장",
"238":"백도 해수욕장",
"239":"문암2리해변",
"240":"자작도 해수욕장",
"241":"천진 해수욕장",
"242":"청간 해수욕장",
"243":"아야진 해수욕장",
"244":"교암리 해수욕장",
"245":"봉포 해수욕장",
"246":"동호 해수욕장",
"247":"오산 해수욕장",
"248":"잔교리 해수욕장",
"249":"하조대 해수욕장",
"250":"죽도 해수욕장",
"251":"갯마을 해수욕장",
"252":"인구 해수욕장",
"253":"동산 해수욕장",
"254":"동산포구 해수욕장",
"255":"광진리 해수욕장",
"256":"원포리 해수욕장",
"257":"지경 해수욕장",
"258":"남애1리 해수욕장",
"259":"남애3리 해수욕장",
"260":"물치 해수욕장",
"261":"정암 해수욕장",
"262":"낙산 해수욕장",
"263":"설악 해수욕장",
"264":"사천진 해수욕장",
"265":"켄싱턴리조트 해수욕장",
"266":"송지호오토캠핑 해수욕장",
"267":"기사문 해수욕장",
"268":"송도 해수욕장(부산)",
"269":"구룡포 해수욕장",
"270":"도구 해수욕장",
"271":"영일대 해수욕장",
"272":"칠포 해수욕장",
"273":"월포 해수욕장",
"274":"화진 해수욕장",
"275":"갈목해변",
"276":"용한1리해수욕장",
"277":"전촌솔밭해변",
"278":"나정고운모래해변",
"279":"오류고아라해변",
"280":"봉길대왕암해변",
"281":"관성솔밭해변",
"282":"남호 해수욕장",
"283":"오보 해수욕장",
"284":"장사 해수욕장",
"285":"경정 해수욕장",
"286":"대진 해수욕장",
"287":"하저리 해수욕장",
"288":"고래불 해수욕장",
"289":"나곡 해수욕장",
"290":"망양정 해수욕장",
"291":"기성망양 해수욕장",
"292":"구산 해수욕장",
"293":"봉평 해수욕장",
"294":"후정 해수욕장",
"295":"비인해수욕장",
"296":"띠섬목해변",
"297":"오도1리해수욕장",
"298":"조사리간이해수욕장",
"299":"오포해수욕장",
"300":"사창해수욕장",
"301":"운여해변",
"302":"두에기해변",
"303":"덕천해수욕장",
"304":"해운대 해수욕장",
"305":"송정 해수욕장",
"306":"광안리 해수욕장",
"307":"임랑 해수욕장",
"308":"다대포 해수욕장",
"309":"일광 해수욕장",
"310":"영리해수욕장",
"311":"일산 해수욕장",
"312":"원안해수욕장",
"313":"진하 해수욕장",
"314":"비진도 해수욕장",
"315":"덕포 해수욕장",
"316":"와현모래숲해변",
"317":"흥남 해수욕장",
"318":"음포해수욕장",
"319":"황포 해수욕장",
"320":"농소몽돌 해수욕장",
"321":"구조라 해수욕장",
"322":"학동흑진주몽돌해변",
"323":"명사 해수욕장",
"324":"함목 해수욕장",
"325":"여차몽돌 해수욕장",
"326":"설리 해수욕장",
"327":"상주은모래비치",
"328":"먼동해수욕장",
"329":"송정솔바람해변",
"330":"두곡.월포 해수욕장",
"331":"사촌 해수욕장",
"332":"남일대 해수욕장",
"333":"덕동 해수욕장",
"334":"수륙 해수욕장",
"335":"사목해수욕장",
"336":"황금산몽돌해변",
"337":"봉암몽돌 해수욕장",
"338":"하트해변",
"339":"월천해변",
"340":"물안(옆개) 해수욕장",
"341":"덕원 해수욕장",
"342":"표선해비치",
"343":"화순금모래 해수욕장",
"344":"신양섭지코지 해수욕장",
"345":"곽지과물 해수욕장",
"346":"협재 해수욕장",
"347":"중문ㆍ색달 해수욕장",
"348":"이호테우 해수욕장",
"349":"삼양검은모래 해수욕장",
"350":"임원해변",
"351":"노가리해수욕장",
"352":"함덕서우봉 해수욕장",
"353":"하고수동 해수욕장",
"354":"김녕성세기 해수욕장",
"355":"금능으뜸원 해수욕장",
"356":"낭하리해변",
"357":"하도 해수욕장",
"358":"용담리해변",
"359":"신남해변",
"360":"사량 대항 해수욕장",
"361":"덕적도 능동자갈마당",
"362":"구봉솔숲해수욕장",
"363":"후포 해수욕장",
"364":"소청예동 해수욕장",
"365":"사곶 해수욕장",
"366":"구리동 해수욕장",
"367":"실미 해수욕장",
"368":"황성금리 해수욕장",
"369":"추포 해수욕장",
"370":"신도 해수욕장",
"371":"배낭기미 해수욕장",
"372":"홍도 해수욕장",
"373":"낭도 해수욕장",
"374":"정강 해수욕장",
"375":"대풍 해수욕장",
"376":"구시포 해수욕장",
"377":"하효쇠소깍 해수욕장",
"378":"종달 해수욕장",
"379":"서빈백사 해수욕장",
"380":"추자모진이 해수욕장",
"381":"밤섬 해수욕장",
"382":"몽돌해수욕장 (옹진군)",
"383":"방아머리해수욕장",
"384":"당너머 해수욕장",
"385":"호도 해수욕장",
"386":"초곡해수욕장",
"387":"곰섬 해수욕장",
"388":"백리포(방주골) 해수욕장",
"389":"사곡 해수욕장",
"390":"구영 해수욕장",
"391":"망치해변 해수욕장",
"392":"옥계 해수욕장",
"393":"한재밑해변",
"394":"거잠포해변",
"395":"용유도 마시안해변",
"396":"선녀바위해수욕장",
"397":"용유도해변",
"398":"왜목마을 해수욕장",
"399":"감추해변",
"400":"한섬해변&한섬감성바닷길",
"401":"고불개해변",
"402":"하평해변(동해)",
"403":"염전해변",
"404":"북분리 해수욕장",
"405":"순포해변",
"406":"대청도 농여해변",
"407":"소돌해수욕장",
"408":"고파도 해수욕장",
"409":"광암 해수욕장",
"410":"청시행비치",
"411":"웅천 해수욕장",
"412":"중광정해변",
"413":"화진포콘도 해수욕장",
"414":"서도 해수욕장",
"415":"설레미 해수욕장",
"416":"짱뚱어 해수욕장",
"417":"향호해수욕장",
"418":"백령도 콩돌해변",
"419":"애견전용해수욕장 멍비치",
"420":"38해변",
        } # 검색어와 해당하는 beach_num의 매핑

import requests
from rest_framework.decorators import api_view
from rest_framework.response import Response
import json, datetime        
from rest_framework.views import APIView
from rest_framework import status

# 물놀이지수와 기온
class WaterPlayScoreView(APIView):
    def get(self, request):
        search_query = request.GET.get('search_query', '')
        service_key = "iQ5bkE39dMSPGAw%2Bh0KADor%2BExmLclc%2BUbLhi0FSLYJmnlSLh1pfjiYcb3IwKV6469VVj4Vd4WtUBNV9bQjiOg%3D%3D"
        
        beach_num = ''
        for key, value in beach_num_mapping.items():
            if search_query in value:
                beach_num = key
                break
        if not beach_num:
            return Response({"error": "검색어에 해당하는 값이 없습니다."}, status=400)
        #base_date = datetime.datetime.now().strftime("%Y%m%d")
        requested_time = datetime.datetime.now()
        #target_time = current_time.replace(minute=45)
        #base_time = target_time.strftime("%H%M")
        #base_time = current_time.strftime("%H%M")
        
        hour = requested_time.hour
        minute = requested_time.minute
        if minute <= 30:
            hour -= 1
        previous_time = requested_time.replace(hour=hour, minute=30)
        base_date = previous_time.strftime("%Y%m%d")
        base_time = previous_time.strftime("%H%M")
        params = {
            "serviceKey": service_key,
            "beach_num": beach_num, 
            "base_date": base_date,  
            "base_time": base_time,  
        }
        url = "http://apis.data.go.kr/1360000/BeachInfoservice/getUltraSrtFcstBeach?serviceKey={}&beach_num={}&dataType=json&numOfRows=100&base_date={}&base_time={}".format(service_key, beach_num, base_date, base_time)
        response = requests.get(url, params=params)
        try:
            response = requests.get(url)
            if response.status_code == 200:
                data = response.json()
                if 'body' in data['response']:
                    water_play = data['response']['body']['items']['item']
                    filtered_water_play = []
                    for item in water_play:
                        if item['category'] in ['SKY', 'T1H']:
                            filtered_water_play.append({
                                'category': item['category'],
                                'fcstTime': item['fcstTime'],
                                'baseDate': item['baseDate'],
                                'fcstValue': item['fcstValue'],
                            })
                    return Response({"filtered_water_play": filtered_water_play}, status=200)
                    #return Response({"water_play": water_play})
                else:
                    return Response({"error": "API 응답에 'body' 키가 없습니다."}, status=response.status_code)
            else:
                return Response({"error": "API 요청 실패"}, status=response.status_code)
        except json.JSONDecodeError as e:
            return Response({"error": "JSON 디코드 오류: " + str(e)}, status=response.status_code)


class WaterTemperatureView(APIView):
    def get(self, request):
        search_query = request.GET.get('search_query', '')
        service_key = "iQ5bkE39dMSPGAw%2Bh0KADor%2BExmLclc%2BUbLhi0FSLYJmnlSLh1pfjiYcb3IwKV6469VVj4Vd4WtUBNV9bQjiOg%3D%3D"

        beach_num = ''
        for key, value in beach_num_mapping.items():
            if search_query in value:
                beach_num = key
                break
        if not beach_num:
            return Response({"error": "검색어에 해당하는 값이 없습니다."}, status=400)

        requested_time = datetime.datetime.now()
        #current_time = datetime.datetime.now()
        #target_time = current_time.replace(minute=45)
        #search_time = target_time.strftime("%Y%m%d%H%M")
        hour = requested_time.hour
        minute = requested_time.minute
        if minute <= 30:
            hour -= 1
        previous_time = requested_time.replace(hour=hour, minute=30)
        search_time = previous_time.strftime("%Y%m%d%H%M")
        params = {
            "serviceKey": service_key,
            "beach_num": beach_num,
            "searchTime": search_time
        }
        url = "http://apis.data.go.kr/1360000/BeachInfoservice/getTwBuoyBeach?serviceKey={}&numOfRows=100&beach_num={}&dataType=JSON&searchTime={}".format(service_key, beach_num, search_time)
        response = requests.get(url, params=params)
        try:
            response = requests.get(url)
            if response.status_code == 200:
                data = response.json()
                print(data)
                if 'body' in data['response']:
                    water_temperature = data['response']['body']['items']['item']
                    return Response({"water_temperature": water_temperature})
                else:
                    return Response({"error": "API 응답에 'body' 키가 없습니다."}, status=response.status_code)
            else:
                return Response({"error": "API 요청 실패"}, status=response.status_code)
        except requests.exceptions.RequestException as e:
            return Response({"error": "API 요청 중 오류 발생: " + str(e)}, status=500)

@api_view(['GET'])
def process_search_query(request):
    search_query = request.GET.get('search_query', '')  # URL의 쿼리 문자열에서 검색어를 가져옴

    # 각 함수를 호출하여 GET 요청을 보내고 응답을 처리합니다.
    WaterScoreandTemaperature = WaterPlayScoreView().get(request).data
    WaterTemperature = WaterTemperatureView().get(request).data

    # 처리된 결과를 원하는 형식으로 가공하여 반환합니다.
    result = {
        'WaterScoreandTemaperature': WaterScoreandTemaperature,
        'WaterTemperature': WaterTemperature,
    }
    return Response(result)

